Revit 2027 API
NavisworksExportOptions.ExportUrls Property
 True to export URL parameters, false otherwise. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportUrls { get; set; }
Public Property ExportUrls As Boolean
	Get
	Set
public:
property bool ExportUrls {
	bool get ();
	void set (bool value);
}
member ExportUrls : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace